Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: give some examples of English-speaking countries
nb: sammenligne noen sider ved levesett, tradisjoner og skikker i Norge og engelskspråklige land

source: employ simple strategies for reading comprehension
nb: bruke enkle strategier for leseforståelse

source: Ejrnæs is of the opinion that although it may often seem as though there are differences in attitude between staff members and parents, it is not because they belong to different groups.
nb: Ejrnæs mener at når det ofte oppleves som om det er en holdningsforskjell mellom barnehagens ansatte og foreldrene, handler det ikke om at de tilhører ulike grupper.

source: The teacher then resolutely lifts Robin up to the bench.
nb: Da løfter pedagogen Robin resolutt opp på benken.

source: Teaching in the subject shall stimulate general education, making room for wonder and reflection.
nb: Undervisningen skal stimulere til allsidig dannelse og gi rom for undring og refleksjon.

source: Views on society, cultural understanding and how philosophers discuss culture and society are included in this main subject area.
nb: Forholdet mellom autoritær og demokratisk tenking og mellom idealer, mål og virkemidler i politikken inngår i hovedområdet.

source: compare speech sounds, words and expressions in the mother tongue and Norwegian
nb: sammenligne språklyder, ord og uttrykk på morsmålet og norsk

source: The ideals underlying design and architecture do not always harmonise with how structures are used in actual practice, a study reveals.
nb: Tanken bak design og arkitektur harmonerer ikke alltid med hvordan det blir brukt i praksis, viser en studie.

source: explain the emergence of the welfare state and describe characteristics of modern Norway
nb: gjøre rede for framveksten av velferdsstaten og beskrive trekk ved Norge i dag

source: lavvo The indoor temperature is approaching 25 degrees Celsius, and skilled worker Marianne Bakke is standing over the pots and pans on the wood-burning stove, stirring.
nb: Gradestokken nærmer seg 25 pluss, og fagarbeider Marianne Bakke står og rører i grytene ved den brennende vedovnen.

source: in English involves the use of language in a nuanced, precise manner with a view to developing one’s English language skills.
nb: i engelsk innebærer bruk av språket på en nyansert og presis måte for å videreutvikle engelsk språkkompetanse.

source: enclosed with the certificate.
nb: medlemslandene til å fremme programmering i skolen.

source: It also means relating critically to information collected from geosciences and formulating hypotheses that can be investigated further.
nb: Videre betyr det å forholde seg kritisk til geofaglig informasjon og formulere hypoteser som kan undersøkes.

source: Pupil participationThe school and apprenticeship-training enterprise shall prepare pupils for participa-tion in democratic decision-making processes and stimulate social commitment, both national y and international y.
nb: ElevmedvirkningSkolen og lærebedriften skal forberede elevene på deltakelse i demokratiske beslut­ningsprosesser og stimulere til samfunnsengasjement både nasjonalt og internasjo­nalt.

source: elaborate on the EU's aims and governing bodies and discuss Norway's relationship to the EU
nb: gjøre rede for EUs mål og styringsorganer og diskutere Norges forhold til EU

source: They have to have time to think, ponder and try again and again.
nb: De må få tenke, fundere og prøve om og om igjen.

source: In addition, she interviewed key persons in the participating municipalities.
nb: I tillegg intervjuet hun nøkkelpersoner i de sju deltakerkommunene.

source: Trouble-shooting and repair work
nb: Feilsøking og reparasjon

source: derive and apply the intersection theorems for the heights, angle bisectors, perpendicular bisectors and medians in a triangle
nb: utlede og bruke skjæringssetningene for høydene, halveringslinjene, midtnormalene og medianene i en trekant

source: manage and use soil for different purposes
nb: behandle og bruke løsmasser til ulike formål

source: Alnervik finds it important that there be tools, e.g. guidelines for reflection, that kindergarten teachers can use when discussing documentation.
nb: Alnervik mener det er viktig at det også finnes verktøy, for eksempel et refleksjonsgrunnlag, som barnehagelærerne bruker når de snakker om dokumentasjon.

source: An evaluation of one’s own language learning in terms of a set of goals is also included in the main subject area.
nb: Vurdering av egen språklæring i forhold til oppsatte mål inngår i hovedområdet.

source: Participa-tion in the Nordic project has thus contributed to the continuous develop-ment of the involved cases and local projects.
nb: Avregningen gir ikke kommunen hjemmel til å fremme krav om tilbakebetalingen overfor de ikke-kommunale barnehagene.

source: Inasmuch as Scandinavian children spend many hours a day in preschool, it is important to know how active they are there.
nb: Ettersom skandinaviske barn tilbringer mange timer i døgnet i barnehagen, er det viktig å vite hvor aktive de er i barnehagen.

source: use and provide rationale for congruence, scales and the Pythagorean theorem for calculations and in practical work
nb: bruke og begrunne bruken av formlikhet, målestokk og Pytagoras’ setning til beregninger og i praktisk arbeid

source: Language, literature and culture
nb: Kultur, samfunn og litteratur

source: give an account of how a researcher’s approach, expectations and experiences can affect research
nb: gjøre rede for hvordan forskeres holdninger, forventninger og erfaringer kan påvirke forskningen

source: Competence aims after Level Vg3 general study programmes
nb: Etter Vg3 – studieforberedende utdanningsprogram

source: This is called personal data.
nb: i henhold til arkivloven.

source: tell about central events and persons in the history of Christianity in Norway up to the Reformation
nb: fortelle om sentrale hendelser og personer i kristendommens historie i Norge fram til reformasjonen

source: This finding also corresponds with results from the 8th grade in Norway, where calculators were widely used, while a high-performance country such as Japan used calculators to a far lesser degree (Grønmo & Onstad, 2009).
nb: Også dette resultatet samsvarer med resultatet for 8. trinn i grunnskolen, hvor Norge brukte kalkulator mye, mens et høytpresterende land som Japan brukte det i langt mer beskjeden grad (Grønmo & Onstad, 2009).

source: The subject area also deals with fundamental concepts that are necessary for working with wave phenomena.
nb: Videre dreier det seg om bruk av matematikk til å beskrive fenomener og forutsi hvordan et system vil oppføre seg i framtiden.

source: give an account of the Norwegian language debate and language policies from 1900 until the present day
nb: greie ut om forholdet mellom norsk og tegnspråk på 1900-tallet og språkenes status i det nye årtusenet

source: in the subject of Norwegian is a skill that assumes command of a different language than a spoken language.
nb: i norsk tegnspråk innebærer å forklare, visualisere, eksemplifisere og forstå andre symbolsystem.

source: analyse the relationship between content, form and purpose in different genres
nb: analysere og vurdere sammenhengen mellom innhold, virkemidler og hensikt i muntlige sjangere

source: 3 A need for documentation of pupil competence in a way
nb: 3 Behov for dokumentasjon av kompetansen til eleven på en

source: use digital tools to find information on the scope of crime in Norway, provide grounds why the community punishes lawbreakers and explain how crime may be prevented
nb: bruke digitale verktøy til å finne informasjon om omfanget av kriminalitet i Norge, begrunne hvorfor samfunnet straffer og gjøre greie for hvordan kriminalitet kan forebygges

source: However, it is important that early childhood educators are clear and prepare the children for exactly what is going to happen’, Værum Sørensen cautions.
nb: Men det er viktig at barnehagelærerne er tydelige og forbereder barna på hva som konkret skal skje, mener Værum Sørensen.

source: describe his or her own observations of weather and clouds and measure temperatures and precipitation
nb: beskrive egne observasjoner av vær og skyer, måle temperatur og nedbør og samtale om værtegn og merkedager

source: The researchers at the Department of Early Childhood Education at Oslo Metropolitan University were therefore surprised when they visited kindergartens to investigate the situation for children under the age of three.
nb: Forskerne ved Institutt for barnehagelærerutdanning ved Høgskolen i Oslo og Akershus ble derfor overrasket da de kom ut i barnehager for å undersøke hverdagslivet for barn under tre år.

source: It means explaining, substantiating and participating in discussions about various proposals and solutions.
nb: Programfaget omfatter redningstjenestens oppbygning og organisering og ambulansens innretning og utstyr.

source: The main subject area Judaism, Islam, Hinduism, Buddhism and Philosophies of life covers these religions and selected philosophies of life from a historic perspective, their written traditions as sources of cultural understanding and beliefs, and how these religions and philosophies of life are understood and practiced around the world and in Norway today.
nb: omfatter disse religioner og utvalgte livssyn i historisk perspektiv, deres skrifttradisjoner som kilde til kulturforståelse og tro og hvordan disse religioner og livssyn blir forstått og praktisert i verden og i Norge i dag.

source: write short messages and simple sentences that describe, narrate and ask
nb: skrive korte tekster som uttrykker meninger og interesser, og som beskriver, forteller og spør

source: In Aquaculture, basic skills are understood as follows:
nb: I akvakultur forstås grunnleggende ferdigheter slik:

source: It shall also teach the significance of Christianity as cultural heritage in our society.
nb: Det skal også gi kjennskap til andre religioner og livssyn og til etiske og filosofiske emner.

source: talk about how words and pictures work together in a given text
nb: samtale om hvordan ord og bilde virker sammen i en tekst

source: explain what the Koran and Hadith are and talk about central stories from Islamic faith
nb: forklare hva Koranen og hadith er og samtale om sentrale islamske fortellinger

source: All the store rooms at Täppan kindergarten have been made into tiny creative playrooms.
nb: Alle bodene i Täppan barnehage er gjort om til små kreative lekerom.

source: They also demonstrate and develop competence in mathematics when reasoning about and arguing for solutions and mathematical relationships.
nb: Videre viser og utvikler de kompetanse i matematikk når de resonnerer over og argumenterer for matematiske sammenhenger.

source: These situations were filmed.
nb: Disse situasjonene ble filmet.

source: The main subject area also deals with how ethics, religion and philosophies of life interrelate.
nb: Innenfor hovedområdet behandles sammenhenger mellom etikk, religion og livssyn.

source: ‘In the sports preschool, staff is more playful.
nb: I idrettsbarnehagen er personalet i større grad med i leken.

source: The programme subjects complement each other, and should be viewed in relation to one another.
nb: Programfagene utfyller hverandre og må ses i sammenheng.

source: For that reason, they now have a big bed where the children can put each other to bed.
nb: Derfor har de nå en stor seng hvor barna kan legge hverandre.

source: ‘Only a few of the respondents mentioned employees’ role as guides to provide support in connection with play and learning.
nb: Bare noen få av deltakerne i undersøkelsen nevnte de ansattes rolle som veiledere og støtte i lek og læring.

source: We don’t consider the word “normal” to be expedient in a kindergarten’, explains Ulla.
nb: Ordet «normal» omtaler de som noe som ikke er formålstjenlig i en barnehage, sier Ulla.

source: give examples of, discuss and elaboate on the communicative potential and limitations of various kinds of media
nb: gi eksempler på og drøfte ulike mediers muligheter og begrensinger for ulike former for kommunikasjon

source: collect, assess and apply subject material from digital sources in spoken and written work
nb: bruke ord og uttrykk knyttet til tradisjonelt og moderne yrkesliv, foreslå og vurdere nye termer

source: The Christian faith and traditions have characterised European and Norwegian culture for centuries.
nb: Kunnskap om samisk naturreligion og samisk verditenkning skal bidra til forståelse av kultur og samfunn, skikker og tradisjoner.

source: ✹ give all pupils and apprentices/trainees equal opportunities to develop
nb: ✹ gi al e elever og lærlinger/lærekandidater like muligheter til å utvikle sine

source: Eventually, the other children resume playing, then Malin sits down and digs in the sand, her back to the others.
nb: Etter hvert begynner de andre barna å leke igjen, og Malin setter seg og graver i sanden med ryggen mot dem.

source: define the terms acid and base and give an account of acid-base reactions
nb: definere syre og base og gjøre rede for syre-base-reaksjoner

source: The pupils demonstrate and develop competence in natural science in the vg3 supplementary programme for general university and college admissions certification when they use relevant subject-related terminology, theories and models to explore, describe, explain and discuss relationships in and between natural-science phenomena.
nb: Elevene viser og utvikler kompetanse i naturfag på vg3 påbygging til generell studiekompetanse når de bruker fagspråk, teorier og modeller til å utforske, beskrive, forklare og drøfte sammenhenger i og mellom naturfaglige fenomener.

source: create stories about people from different societies in the past and present and show how their living conditions and values influenced their thoughts and actions
nb: skape fortellinger om mennesker fra ulike samfunn i fortid og nåtid og vise hvordan livsvilkår og verdier påvirker tanker og handlinger

source: This is true of boys to a lesser extent.
nb: Dette gjelder i mindre grad guttene.

source: And how many children can one grown-up relate to at the same time?
nb: Og hvor mange barn kan én voksenperson forhold seg til på en gang?

source: be familiar with Christian hymnal traditions and some chosen songs, also Sami ones
nb: samtale om skikker og navnetradisjoner som bygger fellesskap mellom mennesker

source: It follows from the premise for mother tongue teaching that the curriculum for mother tongue teaching for language minorities is a transitional plan, one that shall be used only until pupils are able to follow the teaching in accordance with the regular curriculum in Norwegian.
nb: Det følger av premissene for morsmålsopplæringen at læreplanen i morsmål for språklige minoriteter er en overgangsplan som bare skal nyttes til elevene kan følge opplæring etter den ordinære læreplanen i norsk.

source: This opens up new learning arenas and allows new possibilities in teaching reading and writing, as well as the production, composition and editing of texts.
nb: Dette åpner for nye læringsarenaer og gir nye muligheter i lese- og skriveopplæringen, i produksjon, komponering og redigering av tekster.

source: use personal reading experiences when writing fiction and factual prose
nb: skrive sammenhengende med personlig og funksjonell håndskrift

source: They also asked a number of other questions about how the kindergarten should deal with Nikolaj’s situation.
nb: De har også stilt en rekke andre spørsmål som handler om hvordan barnehagen bør forholde seg til dette med Nikolaj.

source: One dilemma to which ECEC practitioners seem rather oblivious, is how they handle femininity.
nb: Et dilemma som de barnehageansatte selv ikke er så bevisste på, er hvordan de håndterer femininitet.

source: With this study, Værum Sørensen has confirmed that it means a great deal for children’s activity level whether or not the preschool staff are active themselves.
nb: Værum Sørensen har i denne studien fått bekreftet at det betyr mye for barns aktivitet om de voksne i barnehagen selv er aktive eller ikke.

source: clean, inspect and maintain a facility and equipment based on the materials’ properties and application
nb: utføre renhold, ettersyn og vedlikehold av anlegg og utstyr ut fra materialenes egenskaper og anvendelse

source: in Communication and culture involves utilizing a variety of electronic media for gathering information, as well as the presentation of one’s own work.
nb: i kommunikasjon og kultur innebærer å benytte ulike elektroniske medier til innsamling av informasjon og presentasjon av eget arbeid.

source: recognise normal behaviour and appearance in fish farm organisms and elaborate on common diseases and parasites
nb: gjenkjenne normal atferd og utseende hos oppdrettsorganismer og gjøre rede for vanlige sykdommer og parasitter

source: An urban kindergarten setting does not offer many opportunities to learn traditional Sámi activities like fishing and reindeer husbandry.
nb: I en bybarnehage er det ikke så mange muligheter for å lære tradisjonelt samisk arbeid, som fiske og reindrift.

source: discuss characters and plot in fairy tales and stories
nb: snakke om innhold og form i eldre og nyere sanger, regler og dikt

source: describe constructions and discuss why some are more stable and withstand greater loads than others
nb: beskrive konstruksjoner og samtale om hvorfor noen er mer stabile og tåler større belastning enn andre

source: give an account of similarities and differences in slang and youth language in Sign Language and Norwegian
nb: beskrive likheter og forskjeller mellom ulike varianter av norsk tegnspråk og mellom ulike nordiske tegnspråk

source: SUMMER JOB There was a lot of traffic on the way to the city centre in the morning.
nb: Hovedområdet handler om regning med og manipulasjon av polynomer og rasjonale uttrykk, og analyse og beregning av endelige og uendelige summer av tall.

source: talk about the use, function and choice of materials in various buildings
nb: samtale om bruk, funksjon og materialvalg i ulike bygninger og lage

source: The researchers concluded that teachers’ attitudes to important pedagogical issues are rarely at odds with those of the parents.
nb: – Barnehagelærernes holdninger til viktige pedagogiske spørsmål står sjelden helt i motsetning til foreldrenes holdninger.

source: reflect on how the past is used locally and by different stakeholders
nb: Å utforske handler om å oppleve og eksperimentere og kan ivareta nysgjerrighet og undring.

source: make use of dictionaries, reference books and digital aids
nb: bruke ordbøker, oppslagsverk og digitale hjelpemidler

source: Geosciences X: 84 teaching hours per year
nb: Geofag X: 84 årstimer

source: Technologies that use solar energy, thermal energy from the earth, air and water, and wind or wave energy are important parts of this main subject area.
nb: Teknologi som utnytter solenergi, varmeeenergi fra jord, luft og vann, og energi i vind og bølger, er en del av hovedområdet.

source: Numeracy in social science to the pupils learning to collect, work with, interpret and analyse data, and then assess the information and statistics that have been presented in graphs and tables.
nb: Læreren skal være i dialog med elevene om utviklingen deres i arbeid med instrumentutøving, kor og ensemble, øving og musikkformidling, og elevene skal få mulighet til å prøve seg fram.

source: use correct work techniques and good working positions, and explain the connection between ergonomics and health
nb: bruke riktige arbeidsteknikker og gode arbeidsstillinger, og forklare sammenhengen mellom ergonomi og helse

source: apply specialist knowledge and terminology from own study programme in conversations, discussions and presentations about school, society and work
nb: bruke relevante og saklige argumenter på norsk eller tegnspråk i diskusjoner og vise åpenhet for andres argumentasjon

source: Furthermore, it means using scale measures and calculating angles, heights and slopes.
nb: Videre betyr det bruk av målestokk og beregning av vinkler, høyder og fall.

source: explain how energy production and energy use can affect the environment locally and globally
nb: hvordan energiproduksjon og energibruk kan påvirke miljøet lokalt og globalt

source: Johansson spent a lot of time on the floors of ECEC institutions in an attempt to capture everyday life on a camcorder.
nb: Johansson har sittet på gulvet i barnehagen og forsøkt å fange hverdagen gjennom et videokamera.

source: describe church edifices and other Christian places of worship, reflect on their significance and use, and use digital tools to search for information and make presentations about this
nb: beskrive kirkebygget og andre kristne gudshus og reflektere over deres betydning og bruk, og nytte digitale verktøy til å søke informasjon og lage presentasjoner

source: To do that, they use yellow paper plates and pipe cleaners that are to be attached to represent sunbeams.
nb: Til det bruker de gule papptallerkener og piperensere som skal settes fast som solstråler.

source: focuses on Christianity in all its varieties, nationally and globally, and in a historical and contemporary perspective.
nb: handler om kristendommen i dens forskjellige varianter nasjonalt og globalt, både i et historisk og et nåtidig perspektiv.

source: explore the possibilities of craft techniques and appropriate technology
nb: utforske muligheter innenfor håndverksteknikker og egnet teknologi

source: understand the main idea in specific technical texts, informational texts and descriptions
nb: forstå hovedideen i enkle faglige tekster, informasjonstekster og beskrivelser

source: To present means to show, explain and outline a topic or a product.
nb: Å presentere er å vise, forklare og legge frem et faglig emne eller et produkt.

source: The parents of the other children feel provoked by his proclivities.
nb: Foreldrene til de andre barna synes det er provoserende.

source: discuss the characteristics and causes of terrorism
nb: diskutere kjennetegn på og årsaker til terrorisme

source: The researchers also noted that staff in all the Nordic countries were concerned about exactly the same aspects of the communication between the adults in the room.
nb: Forskerne registrerte også at de barnehageansatte fra alle de nordiske landene var opptatt av akkurat de samme sidene ved kommunikasjonen mellom de voksne som var i rommet.

source: That puts them in the same situation in the sense that they are parents who have turned over responsibility for their children to a kindergarten.
nb: De er derfor i samme situasjon ved at de er foreldre og har overlatt ansvaret for sine barn til en barnehage.

source: In another, riding a bicycle is not allowed on Thursdays.
nb: I en annen er det ikke lov til å sykle på torsdager.

source: The teaching shall also provide the basis for the individual’s ability to work independently and in accordance with laws, regulations and procedures.
nb: e i programområde for arbeidsmaskiner innebærer å forstå og følge arbeidsbeskrivelser, prosedyrer, reparasjonshåndbøker og standarder.

source: Numeracy in Social science also deals with the use, comparison, analysis and presentation of statistical figures that illustrate development and variation.
nb: Regning i samfunnsfag handler også om å bruke og sammenligne, analysere og presentere statistisk tallmateriell som illustrerer utvikling og variasjon.

source: Children shall have a good foundation for participating in SFO.
nb: I spesielle tilfeller er det mulig å ta eksamen i utlandet.
